In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Introduccion a la series de datos

In [3]:
Estudiantes = pd.Series([16,12,19], index=['Ana','Luis','Carlos']) # Creación de una Serie
print(Estudiantes)

Ana       16
Luis      12
Carlos    19
dtype: int64

In [4]:
Estudiantes['Luis'] # Acceso por etiqueta

np.int64(12)

In [5]:
Estudiantes[1] # Acceso por posición

C:\Users\Usuario\AppData\Local\Temp\ipykernel_5168\3874018014.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  Estudiantes[1] # Acceso por posición

np.int64(12)

In [6]:
Estudiantes.index # Index(['Ana', 'Luis', 'Carlos'], dtype='object')
Estudiantes.values # array([16, 12, 19], dtype=int64)

array([16, 12, 19])

In [7]:
Estudiantes.shape #da la cantidad de elementos (3,)

(3,)

## Introduccion a los dataframes

In [8]:
Estudiantes = pd.DataFrame({'Edad':[16,12,19],
                            'Altura':[1.60,1.70,1.75]}, 
                            index=['Ana','Luis','Carlos']) # Creación de un DataFrame
# Dataframe es una tabla, Serie es una columna
display(Estudiantes) # Muestra el DataFrame en formato tabla
print('hola')

        Edad  Altura
Ana       16    1.60
Luis      12    1.70
Carlos    19    1.75

hola

In [9]:
Estudiantes.dtypes # Muestra los tipos de datos de cada columna

Edad        int64
Altura    float64
dtype: object

In [10]:
Estudiantes.index # Index(['Ana', 'Luis', 'Carlos'], dtype='object')

Index(['Ana', 'Luis', 'Carlos'], dtype='object')

In [11]:
Estudiantes.columns # Index(['Edad', 'Altura'], dtype='object')

Index(['Edad', 'Altura'], dtype='object')

In [12]:
Estudiantes.axes # Muestra los ejes del DataFrame (índices de filas y columnas)

[Index(['Ana', 'Luis', 'Carlos'], dtype='object'),
 Index(['Edad', 'Altura'], dtype='object')]

In [13]:
Estudiantes.values # Muestra los valores del DataFrame como un array de NumPy

array([[16.  ,  1.6 ],
       [12.  ,  1.7 ],
       [19.  ,  1.75]])

## Formas de crear Series y DataFrames

In [14]:
Estudiantes = {'Felipe':14, 'Marta':13, 'Lucia':15}
pd.Series(Estudiantes, index=['Marta','Lucia','Felipe','Ana']) # Creación de una Serie a partir de un diccionario con un índice específico

Marta     13.0
Lucia     15.0
Felipe    14.0
Ana        NaN
dtype: float64

In [15]:
pd.Series(8,index=['a','b','c','d']) # Serie con un valor constante y un índice específico

a    8
b    8
c    8
d    8
dtype: int64

In [16]:
A =np.array([[1,2],[3,4]])
pd.DataFrame(A) # Creación de un DataFrame a partir de un array de NumPy

   0  1
0  1  2
1  3  4

In [17]:
pd.DataFrame(A, index=['Fila1','Fila2'], columns=['Col1','Col2']) # DataFrame con índices y nombres de columnas específicos

       Col1  Col2
Fila1     1     2
Fila2     3     4

## Importacion de datos

In [18]:

%pip install openpyxl

df1 = pd.read_excel("Prueba Santander.xlsx") # Importación de datos desde un archivo Excel
df1

Requirement already satisfied: openpyxl in c:\users\usuario\appdata\local\programs\python\python310\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\usuario\appdata\local\programs\python\python310\lib\site-packages (from openpyxl) (2.0.0)
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 21.2.3; however, version 25.2 is available.
You should consider upgrading via the 'c:\Users\Usuario\AppData\Local\Programs\Python\Python310\python.exe -m pip install --upgrade pip' command.

      Id   Nombre       Edad Estatus  Dinero
0      1     Alan  20.000000  Activo    1000
1      2   Marcus  25.000000  Activo    2000
2      3  Loraine  20.000000  Activo    3000
3      4    Maria  22.000000  Activo    4000
4  Total      NaN   5.583333       4   10000

In [19]:
df2 = pd.read_csv("Prueba Santander.csv") # Importación de datos desde un archivo CSV
df2

      Id   Nombre       Edad Estatus  Dinero
0      1     Alan  20.000000  Activo    1000
1      2   Marcus  25.000000  Activo    2000
2      3  Loraine  20.000000  Activo    3000
3      4    Maria  22.000000  Activo    4000
4  Total      NaN   5.583333       4   10000

In [20]:
df2 = pd.read_csv("Prueba Santander.csv", sep=";") # Importación de datos desde un archivo CSV con separador específico
df2.tail() # Muestra las últimas filas del DataFrame
df2.head() # Muestra las primeras filas del DataFrame

      Id,Nombre,Edad,Estatus,Dinero
0           1,Alan,20.0,Activo,1000
1         2,Marcus,25.0,Activo,2000
2        3,Loraine,20.0,Activo,3000
3          4,Maria,22.0,Activo,4000
4  Total,,5.583333333333333,4,10000

In [21]:
df2.shape # Muestra la forma del DataFrame (número de filas y columnas)

(5, 1)

## Inspeccionando un Dataframe

In [22]:
df2 = pd.read_csv("Prueba Santander.csv") # Importación de datos desde un archivo CSV
df2

      Id   Nombre       Edad Estatus  Dinero
0      1     Alan  20.000000  Activo    1000
1      2   Marcus  25.000000  Activo    2000
2      3  Loraine  20.000000  Activo    3000
3      4    Maria  22.000000  Activo    4000
4  Total      NaN   5.583333       4   10000

In [23]:
df2.head() # Muestra las primeras filas del DataFrame

      Id   Nombre       Edad Estatus  Dinero
0      1     Alan  20.000000  Activo    1000
1      2   Marcus  25.000000  Activo    2000
2      3  Loraine  20.000000  Activo    3000
3      4    Maria  22.000000  Activo    4000
4  Total      NaN   5.583333       4   10000

In [24]:
df2.sample(2) # Muestra una muestra aleatoria de 2 filas del DataFrame

  Id  Nombre  Edad Estatus  Dinero
1  2  Marcus  25.0  Activo    2000
3  4   Maria  22.0  Activo    4000

In [25]:
df2.describe() # Estadísticas descriptivas del DataFrame

            Edad        Dinero
count   5.000000      5.000000
mean   18.516667   4000.000000
std     7.513968   3535.533906
min     5.583333   1000.000000
25%    20.000000   2000.000000
50%    20.000000   3000.000000
75%    22.000000   4000.000000
max    25.000000  10000.000000

In [26]:
df2.info() # Información sobre el DataFrame, incluyendo tipos de datos y memoria utilizada

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Id       5 non-null      object
 1   Nombre   4 non-null      object
 2   Edad     5 non-null      float64
 3   Estatus  5 non-null      object
 4   Dinero   5 non-null      int64
dtypes: float64(1), int64(1), object(3)
memory usage: 328.0+ bytes

## Accediendo a datos

In [27]:
df3 = pd.read_csv("Prueba Santander.csv")
df3.set_index("Id", inplace=True) # Establece la columna "ID" como índice del DataFrame
display(df3.head())

        Nombre       Edad Estatus  Dinero
Id
1         Alan  20.000000  Activo    1000
2       Marcus  25.000000  Activo    2000
3      Loraine  20.000000  Activo    3000
4        Maria  22.000000  Activo    4000
Total      NaN   5.583333       4   10000

In [28]:
df3['Edad'] # Acceso a una columna específica del DataFrame

Id
1        20.000000
2        25.000000
3        20.000000
4        22.000000
Total     5.583333
Name: Edad, dtype: float64

In [29]:
type(df3['Edad']) # Muestra el tipo de dato de la columna 'Edad' (Series)

pandas.core.series.Series

In [30]:
df3.iloc[1] # Acceso a una fila específica por etiqueta (índice)

Nombre     Marcus
Edad         25.0
Estatus    Activo
Dinero       2000
Name: 2, dtype: object

## Rangos y filtrado de datos

In [31]:
df3.iloc[1:4] # Acceso a un rango de filas por posición (de la 1 a la 3)

     Nombre  Edad Estatus  Dinero
Id
2    Marcus  25.0  Activo    2000
3   Loraine  20.0  Activo    3000
4     Maria  22.0  Activo    4000

In [32]:
df3.iloc[1:] # Acceso a todas las filas desde la posición 1 en adelante

        Nombre       Edad Estatus  Dinero
Id
2       Marcus  25.000000  Activo    2000
3      Loraine  20.000000  Activo    3000
4        Maria  22.000000  Activo    4000
Total      NaN   5.583333       4   10000

In [33]:
df3[df3['Edad'] > 20] # Filtrado de filas donde la edad es mayor a 20

    Nombre  Edad Estatus  Dinero
Id
2   Marcus  25.0  Activo    2000
4    Maria  22.0  Activo    4000

In [34]:
df3[df3['Dinero'] < 2000] # Filtrado de filas donde el dinero es menor a 2000

   Nombre  Edad Estatus  Dinero
Id
1    Alan  20.0  Activo    1000

## Gestion de valores nulos

In [42]:
s1 = pd.Series([1,np.nan,3,np.nan,5]) # Serie con valores NaN
display(s1)
df4 = pd.DataFrame({'A':[1,2,np.nan,4],'B':[3,2,5,np.nan], 'C':[np.nan,7,np.nan,2]}, index=['Enero', 'Febrero', 'Marzo', 'Abril']) # DataFrame con valores NaN
display(df4)

0    1.0
1    NaN
2    3.0
3    NaN
4    5.0
dtype: float64

           A    B    C
Enero    1.0  3.0  NaN
Febrero  2.0  2.0  7.0
Marzo    NaN  5.0  NaN
Abril    4.0  NaN  2.0

### Metodos para valores nulos

In [ ]:
s1.isnull() # Verifica si los valores son NaN

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [37]:
df4.isnull() # Verifica si los valores en el DataFrame son NaN

             A      B      C
Enero    False  False   True
Febrero  False  False  False
Marzo     True  False   True
Abril    False   True  False

In [ ]:
s1.dropna() # Elimina los valores NaN de la Serie
s1 # no elimina los NaN del original

0    1.0
1    NaN
2    3.0
3    NaN
4    5.0
dtype: float64

In [40]:
df4.dropna() # Elimina las filas con cualquier valor NaN del DataFrame

           A    B    C
Febrero  2.0  2.0  7.0

In [41]:
df4.dropna(axis=1) # Elimina las columnas con cualquier valor NaN del DataFrame

Empty DataFrame
Columns: []
Index: [Enero, Febrero, Marzo, Abril]

In [43]:
df4.dropna(how= 'all') # Elimina las filas con todos los valores NaN del DataFrame

           A    B    C
Enero    1.0  3.0  NaN
Febrero  2.0  2.0  7.0
Marzo    NaN  5.0  NaN
Abril    4.0  NaN  2.0

In [44]:
df4.dropna(how='any') # Elimina las filas con cualquier valor NaN del DataFrame

           A    B    C
Febrero  2.0  2.0  7.0

In [45]:
df4.fillna(0) # Rellena los valores NaN con 0

           A    B    C
Enero    1.0  3.0  0.0
Febrero  2.0  2.0  7.0
Marzo    0.0  5.0  0.0
Abril    4.0  0.0  2.0

In [46]:
s1.fillna(method='ffill') # Rellena los valores NaN con el valor anterior no nulo

C:\Users\Usuario\AppData\Local\Temp\ipykernel_5168\421198844.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  s1.fillna(method='ffill') # Rellena los valores NaN con el valor anterior no nulo

0    1.0
1    1.0
2    3.0
3    3.0
4    5.0
dtype: float64

In [47]:
s1.fillna(method='bfill') # Rellena los valores NaN con el siguiente valor no nulo

C:\Users\Usuario\AppData\Local\Temp\ipykernel_5168\835207405.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  s1.fillna(method='bfill') # Rellena los valores NaN con el siguiente valor no nulo

0    1.0
1    3.0
2    3.0
3    5.0
4    5.0
dtype: float64

In [48]:
display(df4)
df4.fillna(0)   # Rellena los valores NaN con 0

           A    B    C
Enero    1.0  3.0  NaN
Febrero  2.0  2.0  7.0
Marzo    NaN  5.0  NaN
Abril    4.0  NaN  2.0

           A    B    C
Enero    1.0  3.0  0.0
Febrero  2.0  2.0  7.0
Marzo    0.0  5.0  0.0
Abril    4.0  0.0  2.0

In [ ]:
df4.fillna(axis=1,method='ffill') # Rellena los valores NaN con el valor anterior no nulo a lo largo de las columnas
# Se puede poner axis=0 para filas o axis=1 para columnas

C:\Users\Usuario\AppData\Local\Temp\ipykernel_5168\2042556100.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df4.fillna(axis=1,method='ffill') # Rellena los valores NaN con el valor anterior no nulo a lo largo de las columnas

           A    B    C
Enero    1.0  3.0  3.0
Febrero  2.0  2.0  7.0
Marzo    NaN  5.0  5.0
Abril    4.0  4.0  2.0

## Analizando una base de datos

In [2]:
dfpob = pd.read_csv('Poblacion/p/API_SP.POP.TOTL_DS2_es_csv_v2_9820.csv',skiprows=3) # Importación de datos desde un archivo CSV, omitiendo las primeras 3 filas

In [3]:
display(dfpob.head())

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2016,2017,2018,2019,2020,2021,2022,2023,2024,Unnamed: 69
0,Aruba,ABW,"Población, total",SP.POP.TOTL,54922.0,55578.0,56320.0,57002.0,57619.0,58190.0,...,108727.0,108735.0,108908.0,109203.0,108587.0,107700.0,107310.0,107359.0,107624.0,NaN
1,NaN,AFE,"Población, total",SP.POP.TOTL,130075728.0,133534923.0,137171659.0,140945536.0,144904094.0,149033472.0,...,623369401.0,640058741.0,657801085.0,675950189.0,694446100.0,713090928.0,731821393.0,750503764.0,769294618.0,NaN
2,Afganistán,AFG,"Población, total",SP.POP.TOTL,9035043.0,9214083.0,9404406.0,9604487.0,9814318.0,10036008.0,...,34700612.0,35688935.0,36743039.0,37856121.0,39068979.0,40000412.0,40578842.0,41454761.0,42647492.0,NaN
3,NaN,AFW,"Población, total",SP.POP.TOTL,97630925.0,99706674.0,101854756.0,104089175.0,106388440.0,108772632.0,...,429454743.0,440882906.0,452195915.0,463365429.0,474569351.0,485920997.0,497387180.0,509398589.0,521764076.0,NaN
4,Angola,AGO,"Población, total",SP.POP.TOTL,5231654.0,5301583.0,5354310.0,5408320.0,5464187.0,5521981.0,...,29183070.0,30234839.0,31297155.0,32375632.0,33451132.0,34532429.0,35635029.0,36749906.0,37885849.0,NaN

In [4]:
dfpob.set_index('Country Name', inplace=True) # Establece la columna "Country Name" como índice del DataFrame

In [6]:
dfpob.head()

,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,1966,...,2016,2017,2018,2019,2020,2021,2022,2023,2024,Unnamed: 69
Country Name,,,,,,,,,,,,,,,,,,,,,
Aruba,ABW,"Población, total",SP.POP.TOTL,54922.0,55578.0,56320.0,57002.0,57619.0,58190.0,58694.0,...,108727.0,108735.0,108908.0,109203.0,108587.0,107700.0,107310.0,107359.0,107624.0,NaN
NaN,AFE,"Población, total",SP.POP.TOTL,130075728.0,133534923.0,137171659.0,140945536.0,144904094.0,149033472.0,153281203.0,...,623369401.0,640058741.0,657801085.0,675950189.0,694446100.0,713090928.0,731821393.0,750503764.0,769294618.0,NaN
Afganistán,AFG,"Población, total",SP.POP.TOTL,9035043.0,9214083.0,9404406.0,9604487.0,9814318.0,10036008.0,10266395.0,...,34700612.0,35688935.0,36743039.0,37856121.0,39068979.0,40000412.0,40578842.0,41454761.0,42647492.0,NaN
NaN,AFW,"Población, total",SP.POP.TOTL,97630925.0,99706674.0,101854756.0,104089175.0,106388440.0,108772632.0,111246953.0,...,429454743.0,440882906.0,452195915.0,463365429.0,474569351.0,485920997.0,497387180.0,509398589.0,521764076.0,NaN
Angola,AGO,"Población, total",SP.POP.TOTL,5231654.0,5301583.0,5354310.0,5408320.0,5464187.0,5521981.0,5581386.0,...,29183070.0,30234839.0,31297155.0,32375632.0,33451132.0,34532429.0,35635029.0,36749906.0,37885849.0,NaN

In [ ]:
dfpob['Country Code'] # Acceso a la columna 'Country Code' del DataFrame

Country Name
Aruba              ABW
NaN                AFE
Afganistán         AFG
NaN                AFW
Angola             AGO
                  ...
Kosovo             XKX
Yemen, Rep. del    YEM
Sudáfrica          ZAF
Zambia             ZMB
Zimbabwe           ZWE
Name: Country Code, Length: 266, dtype: object

In [11]:
dfpob1920 = dfpob[[str(k) for k in range(1960, 2020)]] # Acceso a las columnas '1960' y '2019' del DataFrame

In [12]:
display(dfpob1920)

,1960,1961,1962,1963,1964,1965,1966,1967,1968,1969,...,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
Country Name,,,,,,,,,,,,,,,,,,,,,
Aruba,54922.0,55578.0,56320.0,57002.0,57619.0,58190.0,58694.0,58990.0,59069.0,59052.0,...,101838.0,102591.0,104110.0,105675.0,106807.0,107906.0,108727.0,108735.0,108908.0,109203.0
NaN,130075728.0,133534923.0,137171659.0,140945536.0,144904094.0,149033472.0,153281203.0,157704381.0,162329396.0,167088245.0,...,530308387.0,544737983.0,559609961.0,575202699.0,590968990.0,607123269.0,623369401.0,640058741.0,657801085.0,675950189.0
Afganistán,9035043.0,9214083.0,9404406.0,9604487.0,9814318.0,10036008.0,10266395.0,10505959.0,10756922.0,11017409.0,...,28284089.0,29347708.0,30560034.0,31622704.0,32792523.0,33831764.0,34700612.0,35688935.0,36743039.0,37856121.0
NaN,97630925.0,99706674.0,101854756.0,104089175.0,106388440.0,108772632.0,111246953.0,113795019.0,116444636.0,119203521.0,...,364358270.0,374790143.0,385360349.0,396030207.0,406992047.0,418127845.0,429454743.0,440882906.0,452195915.0,463365429.0
Angola,5231654.0,5301583.0,5354310.0,5408320.0,5464187.0,5521981.0,5581386.0,5641807.0,5702699.0,5763685.0,...,23294825.0,24218352.0,25177394.0,26165620.0,27160769.0,28157798.0,29183070.0,30234839.0,31297155.0,32375632.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Kosovo,984846.0,1011421.0,1036950.0,1062737.0,1090270.0,1120168.0,1152586.0,1187667.0,1214208.0,1231460.0,...,1788743.0,1791949.0,1807126.0,1818119.0,1812788.0,1788274.0,1777568.0,1791019.0,1797086.0,1788891.0
"Yemen, Rep. del",5532301.0,5655232.0,5782221.0,5911135.0,6048006.0,6195593.0,6351494.0,6516444.0,6690524.0,6875859.0,...,26754387.0,27582897.0,28433647.0,29312952.0,30226309.0,31159379.0,32109010.0,33090921.0,34085182.0,35111408.0
Sudáfrica,16440172.0,16908035.0,17418522.0,17954564.0,18511361.0,19089380.0,19690087.0,20314066.0,20957287.0,21614676.0,...,52344051.0,52995205.0,53782567.0,54678791.0,55594838.0,56723537.0,57259551.0,57635162.0,58613001.0,59587885.0
Zambia,3153729.0,3254086.0,3358099.0,3465907.0,3577017.0,3692086.0,3812003.0,3936343.0,4065593.0,4197116.0,...,13965594.0,14437796.0,14913629.0,15398997.0,15895315.0,16399089.0,16914423.0,17441320.0,17973569.0,18513839.0
Zimbabwe,3809389.0,3930401.0,4055959.0,4185877.0,4320006.0,4458462.0,4601217.0,4748307.0,4900440.0,5058181.0,...,13356548.0,13595424.0,13817887.0,14013808.0,14207359.0,14399013.0,14600294.0,14812482.0,15034452.0,15271368.0